//服务器错误类型从1开始  所以要减1

const errString = [
	"授权失败，请重新登陆！",                   //1
	"账号异常，请重新登陆！",				    //2
	"房间不存在或已销毁，请重新输入！",		    //3	
	"房间人数已满！",							//4
	"房间状态异常，请点击刷新按钮！",			//5
	"出的牌在我的牌组中不存在！",				//6
	"邮件不存在！",								//7
	"您今天已签过到！",   						//8
	"玩家ID不存在！",							//9
	"您已添加过邀请人ID！",						//10
	"不能为自己的ID",							//11
	"该阶段奖励已领取！",						//12
	"未达到领奖条件！",							//13
	"该回放码错误或回放已失效！",				//14
	"您的钻石不足！",							//15
	"今日分享奖励已领取！",						//16
	"没有权限！",								//17
];

module.exports = {
	errString: errString,
};